Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/atdf/ATSAML22G16A.atdf
        <register name="RANDSEED" offset="0x84" rw="RW" size="4" initval="0x00000000" caption="Random Seed">
        </register>
      </register-group>
    </module>
    <module name="CCL" id="U2225" version="1.0.1" caption="Configurable Custom Logic">
      <register-group name="CCL" caption="Configurable Custom Logic">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="CCL_CTRL__SWRST"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2" values="CCL_CTRL__ENABLE"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40" values="CCL_CTRL__RUNSTDBY"/>
        </register>
        <register name="SEQCTRL" offset="0x4" rw="RW" size="1" count="2" initval="0x00" caption="SEQ Control x">
          <bitfield name="SEQSEL" caption="Sequential Selection" mask="0xF" values="CCL_SEQCTRL__SEQSEL"/>
        </register>
        <register name="LUTCTRL" offset="0x8" rw="RW" size="4" count="4" initval="0x00000000" caption="LUT Control x">
          <bitfield name="ENABLE" caption="LUT Enable" mask="0x2" values="CCL_LUTCTRL__ENABLE"/>
          <bitfield name="FILTSEL" caption="Filter Selection" mask="0x30" values="CCL_LUTCTRL__FILTSEL"/>
          <bitfield name="EDGESEL" caption="Edge Selection" mask="0x80" values="CCL_LUTCTRL__EDGESEL"/>
          <bitfield name="INSEL0" caption="Input Selection 0" mask="0xF00" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL1" caption="Input Selection 1" mask="0xF000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL2" caption="Input Selection 2" mask="0xF0000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INVEI" caption="Inverted Event Input Enable" mask="0x100000" values="CCL_LUTCTRL__INVEI"/>
          <bitfield name="LUTEI" caption="LUT Event Input Enable" mask="0x200000" values="CCL_LUTCTRL__LUTEI"/>
          <bitfield name="LUTEO" caption="LUT Event Output Enable" mask="0x400000" values="CCL_LUTCTRL__LUTEO"/>
          <bitfield name="TRUTH" caption="Truth Value" mask="0xFF000000"/>
        </register>
      </register-group>
      <value-group name="CCL_CTRL__SWRST">
        <value name="DISABLE" caption="The peripheral is not reset" value="0"/>
        <value name="ENABLE" caption="The peripheral is reset" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__ENABLE">
        <value name="DISABLE" caption="The peripheral is disabled" value="0"/>
        <value name="ENABLE" caption="The peripheral is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__RUNSTDBY">
        <value name="DISABLE" caption="Generic clock is not required in standby sleep mode" value="0"/>
        <value name="ENABLE" caption="Generic clock is required in standby sleep mode" value="1"/>
      </value-group>
      <value-group name="CCL_SEQCTRL__SEQSEL">
        <value name="DISABLE" caption="Sequential logic is disabled" value="0"/>
        <value name="DFF" caption="D flip flop" value="1"/>
        <value name="JK" caption="JK flip flop" value="2"/>
        <value name="LATCH" caption="D latch" value="3"/>
        <value name="RS" caption="RS latch" value="4"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__ENABLE">
        <value name="DISABLE" caption="LUT block is disabled" value="0"/>
        <value name="ENABLE" caption="LUT block is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__FILTSEL">
        <value name="DISABLE" caption="Filter disabled" value="0"/>
        <value name="SYNCH" caption="Synchronizer enabled" value="1"/>
        <value name="FILTER" caption="Filter enabled" value="2"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__EDGESEL">
        <value name="DISABLE" caption="Edge detector is disabled" value="0"/>
        <value name="ENABLE" caption="Edge detector is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL">
        <value name="MASK" caption="Masked input" value="0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="1"/>
        <value name="LINK" caption="Linked LUT input source" value="2"/>
        <value name="EVENT" caption="Event input source" value="3"/>
        <value name="IO" caption="I/O pin input source" value="4"/>
        <value name="AC" caption="AC input source" value="5"/>
        <value name="TC" caption="TC input source" value="6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="7"/>
        <value name="TCC" caption="TCC input source" value="8"/>
        <value name="SERCOM" caption="SERCOM input source" value="9"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INVEI">
        <value name="DISABLE" caption="Incoming event is not inverted" value="0"/>
        <value name="ENABLE" caption="Incoming event is inverted" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__LUTEI">
        <value name="DISABLE" caption="LUT incoming event is disabled" value="0"/>
        <value name="ENABLE" caption="LUT incoming event is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__LUTEO">
        <value name="DISABLE" caption="LUT event output is disabled" value="0"/>
        <value name="ENABLE" caption="LUT event output is enabled" value="1"/>
      </value-group>
    </module>
    <module name="DMAC" id="U2223" version="2.2.2" caption="Direct Memory Access Controller">
      <register-group name="DMAC" caption="Direct Memory Access Controller">
        <register name="CTRL" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="DMAENABLE" caption="DMA Enable" mask="0x2"/>
          <bitfield name="CRCENABLE" caption="CRC Enable" mask="0x4"/>
          <bitfield name="LVLEN0" caption="Priority Level 0 Enable" mask="0x100"/>
          <bitfield name="LVLEN1" caption="Priority Level 1 Enable" mask="0x200"/>
          <bitfield name="LVLEN2" caption="Priority Level 2 Enable" mask="0x400"/>
          <bitfield name="LVLEN3" caption="Priority Level 3 Enable" mask="0x800"/>
        </register>
        <register name="CRCCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="CRC Control">
          <bitfield name="CRCBEATSIZE" caption="CRC Beat Size" mask="0x3" values="DMAC_CRCCTRL__CRCBEATSIZE"/>
          <bitfield name="CRCPOLY" caption="CRC Polynomial Type" mask="0xC" values="DMAC_CRCCTRL__CRCPOLY"/>
          <bitfield name="CRCSRC" caption="CRC Input Source" mask="0x3F00" values="DMAC_CRCCTRL__CRCSRC"/>
        </register>
        <register name="CRCDATAIN" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CRC Data Input">
          <bitfield name="CRCDATAIN" caption="CRC Data Input" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCCHKSUM" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="CRC Checksum">
          <bitfield name="CRCCHKSUM" caption="CRC Checksum" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCSTATUS" offset="0xC" rw="RW" size="1" initval="0x00" caption="CRC Status">
          <bitfield name="CRCBUSY" caption="CRC Module Busy" mask="0x1"/>
          <bitfield name="CRCZERO" caption="CRC Zero" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0xD" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="QOSCTRL" offset="0xE" rw="RW" size="1" initval="0x2A" caption="QOS Control">
          <bitfield name="WRBQOS" caption="Write-Back Quality of Service" mask="0x3" values="DMAC_QOSCTRL__WRBQOS"/>
          <bitfield name="FQOS" caption="Fetch Quality of Service" mask="0xC" values="DMAC_QOSCTRL__FQOS"/>
          <bitfield name="DQOS" caption="Data Transfer Quality of Service" mask="0x30" values="DMAC_QOSCTRL__DQOS"/>
        </register>
        <register name="SWTRIGCTRL" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Software Trigger Control">
          <bitfield name="SWTRIG0" caption="Channel 0 Software Trigger" mask="0x1"/>
          <bitfield name="SWTRIG1" caption="Channel 1 Software Trigger" mask="0x2"/>
          <bitfield name="SWTRIG2" caption="Channel 2 Software Trigger" mask="0x4"/>
          <bitfield name="SWTRIG3" caption="Channel 3 Software Trigger" mask="0x8"/>
          <bitfield name="SWTRIG4" caption="Channel 4 Software Trigger" mask="0x10"/>
          <bitfield name="SWTRIG5" caption="Channel 5 Software Trigger" mask="0x20"/>
          <bitfield name="SWTRIG6" caption="Channel 6 Software Trigger" mask="0x40"/>
          <bitfield name="SWTRIG7" caption="Channel 7 Software Trigger" mask="0x80"/>
          <bitfield name="SWTRIG8" caption="Channel 8 Software Trigger" mask="0x100"/>
          <bitfield name="SWTRIG9" caption="Channel 9 Software Trigger" mask="0x200"/>
          <bitfield name="SWTRIG10" caption="Channel 10 Software Trigger" mask="0x400"/>
          <bitfield name="SWTRIG11" caption="Channel 11 Software Trigger" mask="0x800"/>
          <bitfield name="SWTRIG12" caption="Channel 12 Software Trigger" mask="0x1000"/>
          <bitfield name="SWTRIG13" caption="Channel 13 Software Trigger" mask="0x2000"/>
          <bitfield name="SWTRIG14" caption="Channel 14 Software Trigger" mask="0x4000"/>
          <bitfield name="SWTRIG15" caption="Channel 15 Software Trigger" mask="0x8000"/>
        </register>
